# DataFrames

In [11]:
import numpy as np
import pandas as pd

In [12]:
df = pd.read_csv("data_2d.csv")

In [13]:
df.head()

           A          B           C
0  17.930201  94.520592  320.259530
1  97.144697  69.593282  404.634471
2  81.775901   5.737648  181.485108
3  55.854342  70.325902  321.773638
4  49.366550  75.114040  322.465486

In [17]:
df['A']

0     17.930201
1     97.144697
2     81.775901
3     55.854342
4     49.366550
5      3.192702
6     49.200784
7     21.882804
8     79.509863
9     88.153887
10    60.743854
11    67.415582
12    48.318116
13    28.829972
14    43.853743
15    25.313694
16    10.807727
17    98.365746
18    29.146910
19    65.100302
20    24.644113
21    37.559805
22    88.164506
23    13.834621
24    64.410844
25    68.925992
26    39.488442
27    52.463178
28    48.484787
29     8.062088
        ...
70    30.187692
71    11.788418
72    18.292424
73    96.712668
74    31.012739
75    11.397261
76    17.392556
77    72.182694
78    73.980021
79    94.493058
80    84.562821
81    51.742474
82    53.748590
83    85.050835
84    46.777250
85    49.758434
86    24.119256
87    27.201576
88     7.009596
89    97.646950
90     1.382983
91    22.323530
92    45.045406
93    40.163991
94    53.182740
95    46.456779
96    77.130301
97    68.600608
98    41.693887
99     4.142669
Name: A, Length: 100, dtype: float64

In [21]:
df.iloc[35]

A     95.368610
B     47.295507
C    336.126739
Name: 35, dtype: float64

In [24]:
df[['A','C']].tail()

            A           C
95  46.456779  336.876154
96  77.130301  438.460586
97  68.600608  355.900287
98  41.693887  284.834637
99   4.142669  168.034401

In [25]:
df[df['A']<5]

           A          B           C
5   3.192702  29.256299   94.618811
44  3.593966  96.252217  293.237183
54  4.593463  46.335932  145.818745
90  1.382983  84.944087  252.905653
99  4.142669  52.254726  168.034401

# Dataframes and Apply Function

In [28]:
df2 = pd.read_csv("international-airline-passengers.csv", engine='python', skipfooter=3)

In [31]:
df2.columns

Index(['Month', 'International airline passengers: monthly totals in thousands. Jan 49 ? Dec 60'], dtype='object')

In [32]:
df2.columns = ["Month","Passengers"]

In [33]:
df2.columns

Index(['Month', 'Passengers'], dtype='object')

In [36]:
df2.Passengers

0      112
1      118
2      132
3      129
4      121
5      135
6      148
7      148
8      136
9      119
10     104
11     118
12     115
13     126
14     141
15     135
16     125
17     149
18     170
19     170
20     158
21     133
22     114
23     140
24     145
25     150
26     178
27     163
28     172
29     178
      ...
114    491
115    505
116    404
117    359
118    310
119    337
120    360
121    342
122    406
123    396
124    420
125    472
126    548
127    559
128    463
129    407
130    362
131    405
132    417
133    391
134    419
135    461
136    472
137    535
138    622
139    606
140    508
141    461
142    390
143    432
Name: Passengers, Length: 144, dtype: int64

In [37]:
df2['ones'] = 1

In [38]:
df2.head()

     Month  Passengers  ones
0  1949-01         112     1
1  1949-02         118     1
2  1949-03         132     1
3  1949-04         129     1
4  1949-05         121     1

In [39]:
from datetime import datetime

datetime.strptime("1949-05", "%Y-%m")

datetime.datetime(1949, 5, 1, 0, 0)

In [41]:
df2['dt'] = df2.apply(lambda row: datetime.strptime("1949-05", "%Y-%m"),axis = 1)

In [43]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 4 columns):
Month         144 non-null object
Passengers    144 non-null int64
ones          144 non-null int64
dt            144 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 4.6+ KB

# Joins

In [44]:
import pandas as pd

In [45]:
d1 = pd.read_csv("table1.csv")

In [46]:
d2 = pd.read_csv("table2.csv")

In [48]:
d1

   user_id            email  age
0        1  alice@gmail.com   20
1        2    bob@gmail.com   25
2        3  carol@gmail.com   30

In [49]:
d2

    user_id  ad_id  click
0         1      1      1
1         1      2      0
2         1      5      0
3         2      3      0
4         2      4      1
5         2      1      0
6         3      2      0
7         3      1      0
8         3      3      0
9         3      4      0
10        3      5      1

In [50]:
m =pd.merge(d1,d2,on='user_id')

In [51]:
m.head()

   user_id            email  age  ad_id  click
0        1  alice@gmail.com   20      1      1
1        1  alice@gmail.com   20      2      0
2        1  alice@gmail.com   20      5      0
3        2    bob@gmail.com   25      3      0
4        2    bob@gmail.com   25      4      1

In [55]:
d1.merge(d2,on ='user_id')

    user_id            email  age  ad_id  click
0         1  alice@gmail.com   20      1      1
1         1  alice@gmail.com   20      2      0
2         1  alice@gmail.com   20      5      0
3         2    bob@gmail.com   25      3      0
4         2    bob@gmail.com   25      4      1
5         2    bob@gmail.com   25      1      0
6         3  carol@gmail.com   30      2      0
7         3  carol@gmail.com   30      1      0
8         3  carol@gmail.com   30      3      0
9         3  carol@gmail.com   30      4      0
10        3  carol@gmail.com   30      5      1

In [56]:
df2.head()

     Month  Passengers  ones         dt
0  1949-01         112     1 1949-05-01
1  1949-02         118     1 1949-05-01
2  1949-03         132     1 1949-05-01
3  1949-04         129     1 1949-05-01
4  1949-05         121     1 1949-05-01